```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.2.2" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1765626792 -> (known after apply)
          ~ last_deployed  = 1766216975 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 2 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "9.1.9" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      ~ set_wo                     = (write-only attribute)
      ~ set_wo_revision            = 570732210744474064 -> 136739080110713584
      ~ version                    = "9.1.9" -> "9.2.2"
        # (28 unchanged attributes hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64       = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = "/root/.kube/config-files/kub1k.yaml"
      + id                   = (known after apply)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```